Version2/TestTool/TestTool.Setup/Requests/RecordingSearch/FindRecordings/FindRecordings (General).xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:tse="http://www.onvif.org/ver10/search/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <tse:FindRecordings>
      <tse:Scope>
        <tse:IncludedSources>
          <tse:Token>tokenRecordingJob1</tse:Token>
        </tse:IncludedSources>
        <tse:IncludedRecording>tokenRecording1</tse:IncludedRecording>
        <tse:RecordingInformationFilter>RecordingFilter1</tse:RecordingInformationFilter>
      </tse:Scope>
      <tse:MaxMatches>10</tse:MaxMatches>
      <tse:KeepAliveTime>PT60S</tse:KeepAliveTime>
    </tse:FindRecordings>
  </soap:Body>
</soap:Envelope>